# Daisyxmusic (Telegram bot project )
# Copyright (C) 2021  Inukaasith

# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU Affero General Public License as
# published by the Free Software Foundation, either version 3 of the
# License, or (at your option) any later version.

# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU Affero General Public License for more details.
#
# You should have received a copy of the GNU Affero General Public License
# along with this program.  If not, see <https://www.gnu.org/licenses/>.

from DaisyXMusic.config import ASSISTANT_NAME, PROJECT_NAME


class Messages:
    START_MSG = "**HᴇʟʟYᴇᴀʜ 🍻 [{}](tg://user?id={})!**\n\n🤖 I'ᴍ [Sɪɴɴᴇʀ](https://telegra.ph/file/c226623ff79fa51e5d587.jpg). I'ᴍ ᴀɴ ᴀᴅᴠᴀɴᴄᴇᴅ ʙᴏᴛ ᴄʀᴇᴀᴛᴇᴅ ғᴏʀ ᴘʟᴀʏɪɴɢ ᴍᴜsɪᴄ ɪɴ ᴛʜᴇ ᴠᴏɪᴄᴇ ᴄʜᴀᴛs ᴏғ Tᴇʟᴇɢʀᴀᴍ Gʀᴏᴜᴘs & Cʜᴀɴɴᴇʟs.\n\n✅ Sᴇɴᴅ ᴍᴇ /help ғᴏʀ ᴍᴏʀᴇ ɪɴғᴏ."
    HELP_MSG = [
        ".",
        f"""
**Hᴇʏ 🍻 Wᴇʟᴄᴏᴍᴇ ʙᴀᴄᴋ ᴛᴏ {PROJECT_NAME}

⚪️ {PROJECT_NAME} ᴄᴀɴ ᴘʟᴀʏ ᴍᴜsɪᴄ ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ's ᴠᴏɪᴄᴇ ᴄʜᴀᴛ ᴀs ᴡᴇʟʟ ᴀs ᴄʜᴀɴɴᴇʟ ᴠᴏɪᴄᴇ ᴄʜᴀᴛs

⚪️ Assɪsᴛᴀɴᴛ ɴᴀᴍᴇ >> @{ASSISTANT_NAME}\n\nClick next for instructions**
""",
        f"""
**Sᴇᴛᴛɪɴɢ ᴜᴘ**

𝟷) Mᴀᴋᴇ ʙᴏᴛ ᴀᴅᴍɪɴ (Gʀᴏᴜᴘ ᴀɴᴅ ɪɴ ᴄʜᴀɴɴᴇʟ ɪғ ᴜsᴇ ᴄᴘʟᴀʏ)
𝟸) Sᴛᴀʀᴛ ᴀ ᴠᴏɪᴄᴇ ᴄʜᴀᴛ
𝟹) Tʀʏ /ᴘʟᴀʏ [sᴏɴɢ ɴᴀᴍᴇ] ғᴏʀ ᴛʜᴇ ғɪʀsᴛ ᴛɪᴍᴇ ʙʏ ᴀɴ ᴀᴅᴍɪɴ
*) Iғ ᴜsᴇʀʙᴏᴛ ᴊᴏɪɴᴇᴅ ᴇɴᴊᴏʏ ᴍᴜsɪᴄ, Iғ ɴᴏᴛ ᴀᴅᴅ @{ASSISTANT_NAME} ᴛᴏ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴀɴᴅ ʀᴇᴛʀʏ

**Fᴏʀ Cʜᴀɴɴᴇʟ Mᴜsɪᴄ Pʟᴀʏ**
𝟷) Mᴀᴋᴇ ᴍᴇ ᴀᴅᴍɪɴ ᴏғ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ 
𝟸) Sᴇɴᴅ /ᴜsᴇʀʙᴏᴛᴊᴏɪɴᴄʜᴀɴɴᴇʟ ɪɴ ʟɪɴᴋᴇᴅ ɢʀᴏᴜᴘ
𝟹) Nᴏᴡ sᴇɴᴅ ᴄᴏᴍᴍᴀɴᴅs ɪɴ ʟɪɴᴋᴇᴅ ɢʀᴏᴜᴘ
""",
        f"""
**Cᴏᴍᴍᴀɴᴅs**

**=>> Sᴏɴɢ Pʟᴀʏɪɴɢ 🎧**

- /ᴘʟᴀʏ: Pʟᴀʏ ᴛʜᴇ ʀᴇǫᴜᴇsᴛᴅ sᴏɴɢ
- /ᴘʟᴀʏ [ʏᴛ ᴜʀʟ] : Pʟᴀʏ ᴛʜᴇ ɢɪᴠᴇɴ ʏᴛ ᴜʀʟ
- /ᴘʟᴀʏ [ʀᴇᴘʟʏ ʏᴏ ᴀᴜᴅɪᴏ]: Pʟᴀʏ ʀᴇᴘʟɪᴇᴅ ᴀᴜᴅɪᴏ
- /sᴘʟᴀʏ: Pʟᴀʏ sᴏɴɢ ᴠɪᴀ ᴊɪᴏ sᴀᴀᴠɴ
- /ʏᴛᴘʟᴀʏ: Dɪʀᴇᴄᴛʟʏ ᴘʟᴀʏ sᴏɴɢ ᴠɪᴀ Yᴏᴜᴛᴜʙᴇ Mᴜsɪᴄ

**=>> Pʟᴀʏʙᴀᴄᴋ ⏯**

- /ᴘʟᴀʏᴇʀ: Oᴘᴇɴ Sᴇᴛᴛɪɴɢs ᴍᴇɴᴜ ᴏғ ᴘʟᴀʏᴇʀ
- /sᴋɪᴘ: Sᴋɪᴘs ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ ᴛʀᴀᴄᴋ
- /ᴘᴀᴜsᴇ: Pᴀᴜsᴇ ᴛʀᴀᴄᴋ
- /ʀᴇsᴜᴍᴇ: Rᴇsᴜᴍᴇs ᴛʜᴇ ᴘᴀᴜsᴇᴅ ᴛʀᴀᴄᴋ
- /ᴇɴᴅ: Sᴛᴏᴘs ᴍᴇᴅɪᴀ ᴘʟᴀʏʙᴀᴄᴋ
- /ᴍᴜᴛᴇ: ᴍᴜᴛᴇ sᴏɴɢ ᴘʟᴀʏ
- /ᴜɴᴍᴜᴛᴇ: ᴜɴᴍᴜᴛᴇ sᴏɴɢ ᴘʟᴀʏ
- /ᴄᴜʀʀᴇɴᴛ: Sʜᴏᴡs ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ Pʟᴀʏɪɴɢ ᴛʀᴀᴄᴋ
- /ᴘʟᴀʏʟɪsᴛ: Sʜᴏᴡs ᴘʟᴀʏʟɪsᴛ

*Pʟᴀʏᴇʀ ᴄᴍᴅ ᴀɴᴅ ᴀʟʟ ᴏᴛʜᴇʀ ᴄᴍᴅs ᴇxᴄᴇᴘᴛ /ᴘʟᴀʏ, /ᴄᴜʀʀᴇɴᴛ  ᴀɴᴅ /ᴘʟᴀʏʟɪsᴛ  ᴀʀᴇ ᴏɴʟʏ ғᴏʀ ᴀᴅᴍɪɴs ᴏғ ᴛʜᴇ ɢʀᴏᴜᴘ.
""",
        f"""
**=>> Cʜᴀɴɴᴇʟ Mᴜsɪᴄ Pʟᴀʏ 🛠**

⚪️ Fᴏʀ ʟɪɴᴋᴇᴅ ɢʀᴏᴜᴘ ᴀᴅᴍɪɴs ᴏɴʟʏ:

- /ᴄᴘʟᴀʏ [sᴏɴɢ ɴᴀᴍᴇ] - ᴘʟᴀʏ sᴏɴɢ ʏᴏᴜ ʀᴇǫᴜᴇsᴛᴇᴅ
- /ᴄsᴘʟᴀʏ [sᴏɴɢ ɴᴀᴍᴇ] - ᴘʟᴀʏ sᴏɴɢ ʏᴏᴜ ʀᴇǫᴜᴇsᴛᴇᴅ ᴠɪᴀ ᴊɪᴏ sᴀᴀᴠɴ
- /ᴄᴘʟᴀʏʟɪsᴛ - Sʜᴏᴡ ɴᴏᴡ ᴘʟᴀʏɪɴɢ ʟɪsᴛ
- /ᴄᴄᴄᴜʀʀᴇɴᴛ - Sʜᴏᴡ ɴᴏᴡ ᴘʟᴀʏɪɴɢ
- /ᴄᴘʟᴀʏᴇʀ - ᴏᴘᴇɴ ᴍᴜsɪᴄ ᴘʟᴀʏᴇʀ sᴇᴛᴛɪɴɢs ᴘᴀɴᴇʟ
- /ᴄᴘᴀᴜsᴇ - ᴘᴀᴜsᴇ sᴏɴɢ ᴘʟᴀʏ
- /ᴄʀᴇsᴜᴍᴇ - ʀᴇsᴜᴍᴇ sᴏɴɢ ᴘʟᴀʏ
- /ᴄsᴋɪᴘ - ᴘʟᴀʏ ɴᴇxᴛ sᴏɴɢ
- /ᴄᴇɴᴅ - sᴛᴏᴘ ᴍᴜsɪᴄ ᴘʟᴀʏ
- /ᴄᴍᴜᴛᴇ - ᴍᴜᴛᴇ sᴏɴɢ ᴘʟᴀʏ
- /ᴍᴜᴛᴇ - ᴍᴜᴛᴇ sᴏɴɢ ᴘʟᴀʏ
- /ᴜɴᴍᴜᴛᴇ - ᴍᴜᴛᴇ sᴏɴɢ ᴘʟᴀʏ
- /ᴜsᴇʀʙᴏᴛᴊᴏɪɴᴄʜᴀɴɴᴇʟ - ɪɴᴠɪᴛᴇ ᴀssɪsᴛᴀɴᴛ ᴛᴏ ʏᴏᴜʀ ᴄʜᴀᴛ

ᴄʜᴀɴɴᴇʟ ɪs ᴀʟsᴏ ᴄᴀɴ ʙᴇ ᴜsᴇᴅ ɪɴsᴛᴇᴀᴅ ᴏғ ᴄ ( /ᴄᴘʟᴀʏ = /ᴄʜᴀɴɴᴇʟᴘʟᴀʏ )

⚪️ Iғ ʏᴏᴜ ᴅᴏɴʟᴛ ʟɪᴋᴇ ᴛᴏ ᴘʟᴀʏ ɪɴ ʟɪɴᴋᴇᴅ ɢʀᴏᴜᴘ:

𝟷) Gᴇᴛ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ID.
𝟸) Cʀᴇᴀᴛᴇ ᴀ ɢʀᴏᴜᴘ ᴡɪᴛʜ ᴛɪᴛᴛʟᴇ: Cʜᴀɴɴᴇʟ Mᴜsɪᴄ: ʏᴏᴜʀ_ᴄʜᴀɴɴᴇʟ_ɪᴅ
𝟹) Aᴅᴅ ʙᴏᴛ ᴀs Cʜᴀɴɴᴇʟ ᴀᴅᴍɪɴ ᴡɪᴛʜ ғᴜʟʟ ᴘᴇʀᴍs
𝟺) Aᴅᴅ @{ASSISTANT_NAME} ᴛᴏ ᴛʜᴇ ᴄʜᴀɴɴᴇʟ ᴀs ᴀɴ ᴀᴅᴍɪɴ.
𝟻) Sɪᴍᴘʟʏ sᴇɴᴅ ᴄᴏᴍᴍᴀɴᴅs ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ. (ʀᴇᴍᴇᴍʙᴇʀ ᴛᴏ ᴜsᴇ /ʏᴛᴘʟᴀʏ ɪɴsᴛᴇᴀᴅ /ᴘʟᴀʏ)
""",
        f"""
**=>> Mᴏʀᴇ ᴛᴏᴏʟs 🧑‍🔧**

- /ᴍᴜsɪᴄᴘʟᴀʏᴇʀ [ᴏɴ/ᴏғғ]: Eɴᴀʙʟᴇ/Dɪsᴀʙʟᴇ Mᴜsɪᴄ ᴘʟᴀʏᴇʀ
- /ᴀᴅᴍɪɴᴄᴀᴄʜᴇ: Uᴘᴅᴀᴛᴇs ᴀᴅᴍɪɴ ɪɴғᴏ ᴏғ ʏᴏᴜʀ ɢʀᴏᴜᴘ. Tʀʏ ɪғ ʙᴏᴛ ɪsɴ'ᴛ ʀᴇᴄᴏɢɴɪᴢᴇ ᴀᴅᴍɪɴ
- /ᴜsᴇʀʙᴏᴛᴊᴏɪɴ: Iɴᴠɪᴛᴇ @{ASSISTANT_NAME} Usᴇʀʙᴏᴛ ᴛᴏ ʏᴏᴜʀ ᴄʜᴀᴛ
""",
        f"""
**=>> Sᴏɴɢ Dᴏᴡɴʟᴏᴀᴅ 🎸**

- /ᴠɪᴅᴇᴏ [sᴏɴɢ ᴍᴀᴍᴇ]: Dᴏᴡɴʟᴏᴀᴅ ᴠɪᴅᴇᴏ sᴏɴɢ ғʀᴏᴍ ʏᴏᴜᴛᴜʙᴇ
- /sᴏɴɢ [sᴏɴɢ ɴᴀᴍᴇ]: Dᴏᴡɴʟᴏᴀᴅ ᴀᴜᴅɪᴏ sᴏɴɢ ғʀᴏᴍ ʏᴏᴜᴛᴜʙᴇ
- /sᴀᴀᴠɴ [sᴏɴɢ ɴᴀᴍᴇ]: Dᴏᴡɴʟᴏᴀᴅ sᴏɴɢ ғʀᴏᴍ sᴀᴀᴠɴ
- /ᴅᴇᴇᴢᴇʀ [sᴏɴɢ ɴᴀᴍᴇ]: Dᴏᴡɴʟᴏᴀᴅ sᴏɴɢ ғʀᴏᴍ ᴅᴇᴇᴢᴇʀ

**=>> Sᴇᴀʀᴄʜ Tᴏᴏʟs 📄**

- /sᴇᴀʀᴄʜ [sᴏɴɢ ɴᴀᴍᴇ]: Sᴇᴀʀᴄʜ ʏᴏᴜᴛᴜʙᴇ ғᴏʀ sᴏɴɢs
- /ʟʏʀɪᴄs [sᴏɴɢ ɴᴀᴍᴇ]: Gᴇᴛ sᴏɴɢ ʟʏʀɪᴄs
""",
        f"""
**=>> Cᴏᴍᴍᴀɴᴅs ғᴏʀ Sᴜᴅᴏ Usᴇʀs ⚔️**

 - /ᴜsᴇʀʙᴏᴛʟᴇᴀᴠᴇᴀʟʟ - ʀᴇᴍᴏᴠᴇ ᴀssɪsᴛᴀɴᴛ ғʀᴏᴍ ᴀʟʟ ᴄʜᴀᴛs
 - /ʙʀᴏᴀᴅᴄᴀsᴛ <ʀᴇᴘʟʏ ᴛᴏ ᴍᴇssᴀɢᴇ> - ɢʟᴏʙᴀʟʟʏ ʙʀᴏᴅᴄᴀsᴛ ʀᴇᴘʟɪᴇᴅ ᴍᴇssᴀɢᴇ ᴛᴏ ᴀʟʟ ᴄʜᴀᴛs
 - /ᴘᴍᴘᴇʀᴍɪᴛ [ᴏɴ/ᴏғғ] - ᴇɴᴀʙʟᴇ/ᴅɪsᴀʙʟᴇ ᴘᴍᴘᴇʀᴍɪᴛ ᴍᴇssᴀɢᴇ
*Sᴜᴅᴏ Usᴇʀs ᴄᴀɴ ᴇxᴇᴄᴜᴛᴇ ᴀɴʏ ᴄᴏᴍᴍᴀɴᴅ ɪɴ ᴀɴʏ ɢʀᴏᴜᴘs
""",
    ]
